In [1]:
import pandas as pd

In [2]:
# Create the first DataFrame
data1 = {'ID': [1, 2, 3, 4],
         'Name': ['Alice', 'Bob', 'Charlie', 'David']}
df1 = pd.DataFrame(data1)

# Create the second DataFrame
data2 = {'ID': [3, 4, 5, 6],
         'Age': [25, 30, 22, 35]}
df2 = pd.DataFrame(data2)

In [3]:
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [4]:
df2

   ID  Age
0   3   25
1   4   30
2   5   22
3   6   35

In [5]:
# Merge DataFrames using an inner join on the 'ID' column
merged_inner = pd.merge(df1, df2, on='ID', how='inner')
merged_inner

   ID     Name  Age
0   3  Charlie   25
1   4    David   30

In [6]:
# Merge DataFrames using a left join on the 'ID' column
merged_left = pd.merge(df1, df2, on='ID', how='left')
merged_left

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0

In [7]:
# Merge DataFrames using a right join on the 'ID' column
merged_right = pd.merge(df1, df2, on='ID', how='right')
merged_right

   ID     Name  Age
0   3  Charlie   25
1   4    David   30
2   5      NaN   22
3   6      NaN   35

In [8]:
# Merge DataFrames using an outer join on the 'ID' column
merged_outer = pd.merge(df1, df2, on='ID', how='outer')
merged_outer

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0
4   5      NaN  22.0
5   6      NaN  35.0

In [9]:
# Create DataFrames with multiple columns
data1 = {'ID': [1, 2, 3, 4],
         'Name': ['Alice', 'Bob', 'Charlie', 'David'],
         'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df1 = pd.DataFrame(data1)

data2 = {'ID': [3, 4, 5, 6],
         'Age': [25, 30, 22, 35],
         'City': ['Los Angeles', 'Chicago', 'Houston', 'Miami']}
df2 = pd.DataFrame(data2)

# Merge DataFrames on multiple columns
merged_multi = pd.merge(df1, df2, on=['ID', 'City'], how='inner')
merged_multi

   ID     Name         City  Age
0   3  Charlie  Los Angeles   25
1   4    David      Chicago   30